## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8895400788)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"gcr.io/k8s-prow\""]
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Delete
  * module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""]



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be destroyed
  # (because key ["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - field_manager           = "kubectl" -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-tools-namespaces" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "0925e476-239c-4dd0-8ffc-4182f5f5da30" -> null
      - name                    = "prow-tools-namespaces" -> null
      - server_side_apply       = false -> null
      - uid                     = "0925e476-239c-4dd0-8ffc-4182f5f5da30" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: deny
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
                - prow-monitoring
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - openpolicyagent/gatekeeper
                - docker.io/nginx
                - quay.io/prometheus-operator/prometheus-config-reloader
                - quay.io/prometheus-operator/prometheus-operator
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n      - \"prow-monitoring\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"docker.io/nginx\"\n      - \"quay.io/prometheus-operator/prometheus-config-reloader\"\n      - \"quay.io/prometheus-operator/prometheus-operator\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"gcr.io/k8s-prow\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: deny
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
                - prow-monitoring
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - openpolicyagent/gatekeeper
                - docker.io/nginx
                - quay.io/prometheus-operator/prometheus-config-reloader
                - quay.io/prometheus-operator/prometheus-operator
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
                - gcr.io/k8s-prow
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":10573,"Program":"tfcmt","SHA1":"400b4d85fbbcc6f29e7ea40f748dd88609ea84a6","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->